In [76]:
%matplotlib inline
import numpy as np
import pandas as pd

In [ ]:
# np.random.choice: selects random options from a list
# np.random.uniform: generates numbers between a given lower and upper bound
# np.random.random: generates numbers between 0 and 1
# np.random.randn: generates numbers from the standard normal distribution
# np.random.normal: generates numbers from a normal distribution with a specified mean and standard deviation

In [ ]:
# Exercises
# Using the repo setup directions, setup a new local and remote repository named statistics-exercises. The local version of your repo should live inside of ~/codeup-data-science. This repo should be named statistics-exercises

# Do your work for this exercise in either a python file named simulation.py or a jupyter notebook named simulation.ipynb.

# How likely is it that you roll doubles when rolling two dice?

# If you flip 8 coins, what is the probability of getting exactly 3 heads? What is the probability of getting more than 3 heads?

# There are approximitely 3 web development cohorts for every 1 data science cohort at Codeup. Assuming that Codeup randomly selects an alumni to put on a billboard, what are the odds that the two billboards I drive past both have data science students on them?

# Codeup students buy, on average, 3 poptart packages with a standard deviation of 1.5 a day from the snack vending machine. If on monday the machine is restocked with 17 poptart packages, how likely is it that I will be able to buy some poptarts on Friday afternoon? (Remember, if you have mean and standard deviation, use the np.random.normal)

# Compare Heights

# Men have an average height of 178 cm and standard deviation of 8cm.
# Women have a mean of 170, sd = 6cm.
# Since you have means and standard deviations, you can use np.random.normal to generate observations.
# If a man and woman are chosen at random, what is the likelihood the woman is taller than the man?
# When installing anaconda on a student's computer, there's a 1 in 250 chance that the download is corrupted and the installation fails. What are the odds that after having 50 students download anaconda, no one has an installation issue? 100 students?

# What is the probability that we observe an installation issue within the first 150 students that download anaconda?

# How likely is it that 450 students all download anaconda without an issue?

# There's a 70% chance on any given day that there will be at least one food truck at Travis Park. However, you haven't seen a food truck there in 3 days. How unlikely is this?

# How likely is it that a food truck will show up sometime this week?

# If 23 people are in the same room, what are the odds that two of them share a birthday? What if it's 20 people? 40?

In [6]:
# How likely is it that you roll doubles when rolling two dice?
n_trials = n_rows = 10_000
n_dice  = n_cols = 2
rolls = np.random.choice([1,2,3,4,5,6],n_trials * n_dice).reshape(n_rows, n_cols)
rolls

array([[3, 4],
       [2, 4],
       [1, 6],
       ...,
       [2, 6],
       [3, 4],
       [4, 3]])

In [13]:
rolls_df = pd.DataFrame(rolls)
rolls_df

      0  1
0     3  4
1     2  4
2     1  6
3     4  5
4     3  6
...  .. ..
9995  5  1
9996  2  5
9997  2  6
9998  3  4
9999  4  3

[10000 rows x 2 columns]

In [15]:
rolls_df["if_doubles"]= rolls_df[0]==rolls_df[1]
rolls_df

      0  1  if_doubles
0     3  4       False
1     2  4       False
2     1  6       False
3     4  5       False
4     3  6       False
...  .. ..         ...
9995  5  1       False
9996  2  5       False
9997  2  6       False
9998  3  4       False
9999  4  3       False

[10000 rows x 3 columns]

In [24]:
rolls_df.apply(lambda row: 3 in row.values, axis=1).mean() #counts and averages the values at third sow in a boolean

0.3115

In [25]:
# sums_by_trial = rolls.sum(axis=1)
# sums_by_trial    #for converting the code into a sum of the lists in the array and summingnthem up

In [ ]:
# Next we create the rolls variable that holds a 3 x 10,000 matrix 
# where each element is a randomly chosen number from 1 to 6

In [35]:
num_trials = num_rows = 10000
num_dice  = num_cols = 8
toss = np.random.choice([0,1], num_trials*num_dice).reshape(num_rows,num_cols)
toss
toss_df = pd.DataFrame(toss)
toss_df

      0  1  2  3  4  5  6  7
0     1  0  1  0  1  1  1  1
1     0  1  1  1  0  0  0  1
2     1  1  1  1  1  1  1  0
3     0  1  0  0  0  0  0  0
4     0  0  1  0  1  1  1  1
...  .. .. .. .. .. .. .. ..
9995  1  0  1  0  1  0  0  1
9996  1  0  0  1  1  0  1  1
9997  0  0  1  1  0  1  0  0
9998  0  0  1  0  0  0  0  0
9999  0  0  0  0  0  1  0  0

[10000 rows x 8 columns]

In [54]:
toss_df["sum_of_toss"] = sum_toss= (toss_df.sum(axis =1))
toss_df

      0  1  2  3  4  5  6  7  sum_of_toss
0     1  0  1  0  1  1  1  1           18
1     0  1  1  1  0  0  0  1           12
2     1  1  1  1  1  1  1  0           21
3     0  1  0  0  0  0  0  0            3
4     0  0  1  0  1  1  1  1           15
...  .. .. .. .. .. .. .. ..          ...
9995  1  0  1  0  1  0  0  1           12
9996  1  0  0  1  1  0  1  1           15
9997  0  0  1  1  0  1  0  0            9
9998  0  0  1  0  0  0  0  0            3
9999  0  0  0  0  0  1  0  0            3

[10000 rows x 9 columns]

In [48]:
toss_df.apply(lambda row: 8 in row.values, axis=1).mean() #counts and averages the values at third sow in a boolean

0.2748

In [ ]:
# There are approximitely 3 web development cohorts for every 1 data science cohort at Codeup. 
# Assuming that Codeup randomly selects an alumni to put on a billboard, 
# what are the odds that the two billboards I drive past both have data science students on them?

In [77]:
num_trials = num_rows1 = 10000
num_group  = num_cols1 = 2
toss2 = np.random.choice([0,1], num_trials*num_group, p = (0.75, 0.25)).reshape(num_rows1,num_cols1)
df_toss2=pd.DataFrame(toss2)
df_toss2

      0  1
0     0  0
1     1  1
2     0  0
3     0  0
4     0  0
...  .. ..
9995  0  0
9996  1  1
9997  0  0
9998  0  0
9999  0  0

[10000 rows x 2 columns]

In [78]:
df_toss2["sum_of_toss"] = sum_dstoss= (df_toss2.sum(axis =1))
df_toss2

      0  1  sum_of_toss
0     0  0            0
1     1  1            2
2     0  0            0
3     0  0            0
4     0  0            0
...  .. ..          ...
9995  0  0            0
9996  1  1            2
9997  0  0            0
9998  0  0            0
9999  0  0            0

[10000 rows x 3 columns]

In [81]:
(df_toss2.sum_of_toss ==2).mean()

0.0664